
#include <reg52.h>
#include "delay.h"
#include "beep.h"
#include "datatype.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////

sbit s2 = P3 ^ 0;
sbit beep = P2 ^ 3;
//当按键S5被按下时，蜂鸣器响。松开后不响
void beepExample()
{
    while (1)
    {
        if (!s2)
            beep = 0;
        else
            beep = 1;
    }
}

////////////////////////////////////////////////////////////////////////////////////////////////////////

//按下JW - 51 实验板上的S5按键时（一直按着），会发出频率为1000HZ和2000HZ交替
//的信号，通过蜂鸣器发出类似于救护车发出的报警声。 sbit kaiguan = P3 ^ 0;
void baojing()
{
    while (1)
    {
        if (!s2)
        {
            uint m;
            for (m = 800; m > 0; m--) //持续时间0.5ms*800
            {
                beep = ~beep;
                Delay_Ms(5); //2000HZ的信号。
            }
            for (m = 500; m > 0; m--) //持续时间0.5ms*2*500
            {
                beep = ~beep;
                Delay_Ms(5);
                Delay_Ms(5); //1000HZ的信号。
            }
        }
    }
}

////////////////////////////////////////////////////////////////////////////////////////////////////////

bit flag;         //标志音乐输出脚电平的高低
uchar ptr = 0x00; //取音符
uchar high;       //计数器高位
uchar low;        //计数器低位
// 本曲谱为 "新年好",每三个十六进制数为一组,前两个十六进制表示发声频率(0xFF,0xFF表示休止符),后一个表示发声时间
// 0x00 表示结束
uchar code music[] = {
    // 1 _ 1_ 1 .5
    0xFC, 0x44, 0x7F, 0xFC, 0x44, 0x7F, 0xFC, 0x44, 0xFF, 0xFA, 0x68, 0xFF,
    // 3 _ 3_ 3 1
    0xFD, 0x23, 0x7F, 0xFD, 0x23, 0x7F, 0xFD, 0x23, 0xFF, 0xFC, 0x44, 0xFF,
    // 1_ 3_ 5 5
    0xFC, 0x44, 0x7F, 0xFD, 0x23, 0x7F, 0xFD, 0x82, 0xFF, 0xFD, 0x82, 0xFF,
    // 4_ 3_ 2 -
    0xFD, 0x23, 0x7F, 0xFD, 0x23, 0x7F, 0xFC, 0xAC, 0xFF, 0xFF, 0xFF, 0xFF,
    // 2_ 3_ 4 4
    0xFC, 0xAC, 0x7F, 0xFD, 0x23, 0x7F, 0xFD, 0x34, 0xFF, 0xFD, 0x34, 0xFF,
    // 3_ 2_ 3 1
    0xFD, 0x23, 0x7F, 0xFC, 0xAC, 0x7F, 0xFD, 0x23, 0xFF, 0xFC, 0x44, 0xFF,
    // 1_ 3_ 2 .5
    0xFC, 0x44, 0x7F, 0xFD, 0x23, 0x7F, 0xFC, 0xAC, 0xFF, 0xFA, 0x68, 0xFF,
    // .7_ 2_ 1 -
    0xFC, 0x0C, 0x7F, 0xFC, 0xAC, 0x7F, 0xFC, 0x44, 0xFF, 0xFF, 0xFF, 0xFF,
    0x00 //结束
};

void Init(void); //初始化函数

/*********************************************************************************
* 名称：happyNewYear()
* 功能：播放新年好的音乐
*********************************************************************************/
void happyNewYear()
{
    uchar time;
    Init();
    TH0 = high; //初始等于0
    TL0 = low;  //初始等于0
    while (1)
    {
        if (music[ptr] != 0xFF && music[ptr] != 0x00) //判断是否是正常音符
        {
            TR0 = 0;               //关闭T0计时器
            beep = 1;              //高电平
            Delay_Ms(10);          //间歇
            TR0 = 1;               //开T0计时器
            high = music[ptr];     //取设置频率数值的高8位
            low = music[ptr + 1];  //取设置频率数值的低8位
            time = music[ptr + 2]; //取发声时间
            Delay_Ms(time);
            ptr += 3;
        }
        else if (music[ptr] == 0xFF) //判断是否是休止符
        {
            time = music[ptr + 2];
            Delay_Ms(time);
            ptr += 3;
        }

        else //结束符,停止2 秒后继续
        {
            TR0 = 0;
            beep = 1;
            Delay_Ms(2000);
            ptr = 0;
        }
    }
}
/*********************************************************************************
* 名称：Count1(void) interrupt 1
* 功能：设置计时器0 溢出中断,每中断一次改变P2_3 引脚电平
*********************************************************************************/

void Count1(void) interrupt 1
{
    TH0 = high;
    TL0 = low;
    if (flag == 0) //改变P2_3 引脚电平
    {
        beep = 0;
        flag = 1;
    }
    else
    {
        beep = 1;
        flag = 0;
    }
}

/*********************************************************************************
* 名称：Init()
* 功能：设置计数器0 工作方式,16 位计数,溢出中断方式
**********************************************************************************/
void Init()
{
    TMOD = 0x01; //定时器0处于计时方式1,16位定时器/计数器模式
    EA = 1;      //全局中断允许位 开
    ET0 = 1;     //定时器0 允许中断
}

////////////////////////////////////////////////////////////////////////////////////////////////////////
