
#include <reg52.h>
#include "delay.h"
#include "datatype.h"
#include "qxmcs51_config.h"

////////////////////////////////////////////////////////////////////////////////////////////////////////

sbit s2 = P3 ^ 0;
//当按键S5被按下时，蜂鸣器响。松开后不响
void beepExample()
{
    while (1)
    {
        if (!s2)
            BEEP = 0;
        else
            BEEP = 1;
    }
}

////////////////////////////////////////////////////////////////////////////////////////////////////////

//按下JW - 51 实验板上的S5按键时（一直按着），会发出频率为1000HZ和2000HZ交替
//的信号，通过蜂鸣器发出类似于救护车发出的报警声。 sbit kaiguan = P3 ^ 0;
void baojing()
{
    while (1)
    {
        if (!s2)
        {
            uint m;
            for (m = 800; m > 0; m--) //持续时间0.5ms*800
            {
                BEEP = ~BEEP;
                Delay_Ms(5); //2000HZ的信号。
            }
            for (m = 500; m > 0; m--) //持续时间0.5ms*2*500
            {
                BEEP = ~BEEP;
                Delay_Ms(5);
                Delay_Ms(5); //1000HZ的信号。
            }
        }
    }
}

////////////////////////////////////////////////////////////////////////////////////////////////////////
//警车声

uchar frq;//用于控制频率不断增大

/*------------------------------------------------
                    定时器初始化子程序
------------------------------------------------*/
void Init_Timer0(void)
{
    TMOD |= 0x01; //使用模式1，16位定时器，使用"|"符号可以在使用多个定时器时不受影响
    //TH0=0x00;	      //给定初值
    //TL0=0x00;
    EA = 1;  //总中断打开
    ET0 = 1; //定时器中断打开
    TR0 = 1; //定时器开关打开
}
/*------------------------------------------------
                    主函数
------------------------------------------------*/
void jingchesheng()//播放警车声
{
    Init_Timer0(); //初始化定时器
    while (1)
    {

        Delay_Ms(1); //延时1ms，累加频率值
        frq++;
    }
}

/*------------------------------------------------
                 定时器中断子程序
------------------------------------------------*/
void Timer0_isr(void) interrupt 1
{
    TH0 = 0xfe; //重新赋值
    TL0 = frq;  //低8位值在主程序中不断累加

    BEEP = !BEEP; //端口电平取反
}
