

/*************	功能说明	**************

本文件为STC 12T系列的延时程序,用户几乎可以不修改这个程序.


******************************************/
#include "qxmcs51_config.h"
#include "delay.h"

//========================================================================
// 函数: void  Delay_Ms(INT16U ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2014-8-8
// 备注:
//========================================================================
void Delay_Ms(INT16U ms)
{
	INT16U i;
	do
	{
		i = MAIN_Fosc / 96000;
		while (--i)
			; //96T per loop
	} while (--ms);
}
//========================================================================
// 函数: void  Delay5us()
// 描述: 5us延时函数，自动适应11.0592M、12M、22.1184M主时钟。
// 参数: none.
// 返回: none.
// 版本: VER1.0
// 日期: 2014-8-9
// 备注:
//========================================================================
void Delay5us()
{
#if MAIN_Fosc == 11059200
	_nop_();
#elif MAIN_Fosc == 12000000
	_nop_()
#elif MAIN_Fosc == 22118400
	_nop_();
	_nop_();
	_nop_();
#endif
}
/*延时us*5微秒*/
void Delay5us(int us)
{
	int i;
#if MAIN_Fosc == 11059200
	for (i = 0; i < us; i++)
		_nop_();
#elif MAIN_Fosc == 12000000
	for (i = 0; i < us; i++)
		_nop_()
#elif MAIN_Fosc == 22118400
	for (i = 0; i < us; i++)
	{
		_nop_();
		_nop_();
		_nop_();
	}
#endif
}